#### CrawlingHub Terraform Plan 📋

**Environment**: Production
**Modules**: 1

<details><summary>📦 ecr</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.crawlinghub will be created
  + resource "aws_ecr_lifecycle_policy" "crawlinghub" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "최근 10개 이미지만 유지"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "prod-",
                              + "release-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "태그 없는 이미지 7일 후 삭제"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-prod"
    }

  # aws_ecr_repository.crawlinghub will be created
  + resource "aws_ecr_repository" "crawlinghub" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "crawlinghub-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ecr/crawlinghub"
          + "Name"        = "ecr-crawlinghub-prod"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ecr/crawlinghub"
          + "Name"        = "ecr-crawlinghub-prod"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.crawlinghub_github_actions will be created
  + resource "aws_ecr_repository_policy" "crawlinghub_github_actions" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:role/GitHubActionsRole"
                        }
                      + Sid       = "AllowGitHubActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-prod"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + registry_id     = (known after apply)
  + repository_arn  = (known after apply)
  + repository_url  = (known after apply)

```

</details>


*Pushed by: @ryu-qqq, Action: `pull_request`*

---
**Next Steps:**
1. Review the Terraform plan above
2. Approve this PR if changes look correct
3. Merge to trigger deployment
